def main():
    print("Welcome to the assistant bot!")
    while True:
        command = input("Enter a command: ").strip().lower()

        if command in ["close", "exit"]:
            print("Good bye!")
            break

        elif command == "hello":
            print("How can I help you?")
        else:
            print("Invalid command.")

if __name__ == "__main__":
    main()




'''	
		Будь-який CLI складається з трьох основних елементів:

		Парсер команд. Частина, яка відповідає за розбір введених користувачем рядків,
		  виділення з рядка ключових слів та модифікаторів команд.
		Функції обробники команд - набір функцій, які ще називають handler, 
		вони відповідають за безпосереднє виконання команд.
		Цикл запит-відповідь. Ця частина застосунку відповідає за отримання від користувача 
		даних та повернення користувачеві відповіді від функції - handler-а.
	
	
		1  бот-асистент повинен вміти зберігати ім'я та номер телефону, знаходити номер 
		телефону за ім'ям, змінювати записаний номер телефону, виводити в консоль всі записи, які зберіг
         
		2  Щоб реалізувати таку нескладну логіку, скористаємося словником. У словнику будемо зберігати
		  ім'я користувача, як ключ, і номер телефону як значення.


		Вимоги до завдання:

Програма повинна мати функцію main(), яка управляє основним циклом обробки команд.
Реалізуйте функцію parse_input(), яка розбиратиме введений користувачем рядок на команду 
та її аргументи. Команди та аргументи мають бути розпізнані незалежно від регістру введення.
Ваша програма повинна очікувати на введення команд користувачем та обробляти їх за допомогою відповідних 
функцій. В разі введення команди "exit" або "close", програма повинна завершувати виконання.
Напишіть функції обробники для різних команд, такі як add_contact(), change_contact(), show_phone() тощо.
Використовуйте словник Python для зберігання імен і номерів телефонів. Ім'я буде ключем, а номер телефону – значенням.
Ваша програма має вміти ідентифікувати та повідомляти про неправильно введені команди.


	"hello" → How can I help you?
		add [ім'я] [номер телефону] → Contact added.
		change [ім'я] [новий номер телефону] → Contact updated.
		phone [ім'я] → [номер телефону]
		all → усі збережені контакти з номерами телефонів
		exit → Good bye!
        
        
        
        
        def main():
    print("Welcome to the assistant bot!")
    while True:
        command = input("Enter a command: ").strip().lower()

        if command in ["close", "exit"]:
            print("Good bye!")
            break

        elif command == "hello":
            print("How can I help you?")
        else:
            print("Invalid command.")

		if __name__ == "__main__":
    	main()
        
        
        

		'''